package com.caipiao.core.library.enums;

/**
 * 彩种Tag枚舉
 *
 */
public enum CaipiaoPlayTypeEnum {
	/**
	 * 澳洲ACT 2201 大小  
	 * */
	AUSACTBIG("澳洲ACT","澳洲ACT","大小","大小", 1),
	/**
	 * 澳洲ACT 单双  
	 * */
	AUSACTDOUBLE("澳洲ACT","澳洲ACT","单双","单双", 2),
	/**
	 * PC蛋蛋 1501 混合大小  
	 * */
	PCEGGBIG("PC蛋蛋","混合","混合","大小", 3),
	/**
	 * PC蛋蛋 混合单双  
	 * */
	PCEGGDOUBLE("PC蛋蛋","混合","混合","单双", 4),
	/**
	 *  德州时时彩  1106 两面总和大小  
	 * */
	JSSSCLMZHBIG("德州时时彩","两面","总和、龙虎","总和大小", 5),
	/**
	 *  德州时时彩  第一球大小  
	 * */
	JSSSCDYQBIG("德州时时彩","两面","第一球","第一球大小", 6),
	/**
	 *  德州时时彩  第二球大小  
	 * */
	JSSSCDEQBIG("德州时时彩","两面","第二球","第二球大小", 7),
	/**
	 *  德州时时彩  第三球大小  
	 * */
	JSSSCDSQBIG("德州时时彩","两面","第三球","第三球大小", 8),
	/**
	 *  德州时时彩  第四球大小  
	 * */
	JSSSCDFQBIG("德州时时彩","两面","第四球","第四球大小", 9),
	/**
	 *  德州时时彩  第五球大小  
	 * */
	JSSSCDWQBIG("德州时时彩","两面","第五球","第五球大小", 10),
	/**
	 *  德州时时彩  两面总和单双 
	 * */
	JSSSCLMZHDOUBLE("德州时时彩","两面","总和、龙虎","总和单双", 11),
	/**
	 *  德州时时彩  第一球单双 
	 * */
	JSSSCDYQDOUBLE("德州时时彩","两面","第一球","第一球单双", 12),
	/**
	 *  德州时时彩  第二球单双 
	 * */
	JSSSCDEQDOUBLE("德州时时彩","两面","第二球","第二球单双", 13),
	/**
	 *  德州时时彩  第三球单双 
	 * */
	JSSSCDSQDOUBLE("德州时时彩","两面","第三球","第三球单双", 14),
	/**
	 *  德州时时彩  第四球单双 
	 * */
	JSSSCDFQDOUBLE("德州时时彩","两面","第四球","第四球单双", 15),
	/**
	 *  德州时时彩  第五球单双 
	 * */
	JSSSCDWQDOUBLE("德州时时彩","两面","第五球","第五球单双", 16),
	/**
	 *  德州PK10  1304  冠亚和大小 
	 * */
	JSPKSGYHBIG("德州PK10","两面","冠亚和","冠亚和大小", 17),
	/**
	 *  德州PK10  冠军大小 
	 * */
	JSPKSGJBIG("德州PK10","两面","冠军","冠军大小", 18),
	/**
	 *  德州PK10  亚军大小 
	 * */
	JSPKSYJBIG("德州PK10","两面","亚军","亚军大小", 19),
	/**
	 *  德州PK10  第三名大小 
	 * */
	JSPKSDSMBIG("德州PK10","两面","第三名","第三名大小", 20),
	/**
	 *  德州PK10  第四名大小 
	 * */
	JSPKSDFMBIG("德州PK10","两面","第四名","第四名大小", 21),
	/**
	 *  德州PK10  第五名大小 
	 * */
	JSPKSDWMBIG("德州PK10","两面","第五名","第五名大小", 22),
	/**
	 *  德州PK10  第六名大小
	 * */
	JSPKSDLMBIG("德州PK10","两面","第六名","第六名大小", 23),
	/**
	 *  德州PK10  第七名大小
	 * */
	JSPKSDQMBIG("德州PK10","两面","第七名","第七名大小", 24),
	/**
	 *  德州PK10  第八名大小
	 * */
	JSPKSDMMBIG("德州PK10","两面","第八名","第八名大小", 25),
	/**
	 *  德州PK10  第九名大小
	 * */
	JSPKSDJMBIG("德州PK10","两面","第九名","第九名大小", 26),
	/**
	 *  德州PK10  第十名大小
	 * */
	JSPKSDTMBIG("德州PK10","两面","第十名","第十名大小", 27),
	/**
	 *  德州PK10  冠亚和单双 
	 * */
	JSPKSGYHDOUBLE("德州PK10","两面","冠亚和","冠亚和单双", 28),
	/**
	 *  德州PK10  冠军单双 
	 * */
	JSPKSGJDOUBLE("德州PK10","两面","冠军","冠军单双", 29),
	/**
	 *  德州PK10  亚军单双 
	 * */
	JSPKSYJDOUBLE("德州PK10","两面","亚军","亚军单双", 30),
	/**
	 *  德州PK10  第三名单双
	 * */
	JSPKSDSMDOUBLE("德州PK10","两面","第三名","第三名单双", 31),
	/**
	 *  德州PK10  第四名单双
	 * */
	JSPKSDFMDOUBLE("德州PK10","两面","第四名","第四名单双", 32),
	/**
	 *  德州PK10  第五名单双
	 * */
	JSPKSDWMDOUBLE("德州PK10","两面","第五名","第五名单双", 33),
	/**
	 *  德州PK10  第六名单双
	 * */
	JSPKSDLMDOUBLE("德州PK10","两面","第六名","第六名单双", 34),
	/**
	 *  德州PK10  第七名单双
	 * */
	JSPKSDQMDOUBLE("德州PK10","两面","第七名","第七名单双", 35),
	/**
	 *  德州PK10  第八名单双
	 * */
	JSPKSDMMDOUBLE("德州PK10","两面","第八名","第八名单双", 36),
	/**
	 *  德州PK10  第九名单双
	 * */
	JSPKSDJMDOUBLE("德州PK10","两面","第九名","第九名单双", 37),
	/**
	 *  德州PK10  第十名单双
	 * */
	JSPKSDTMDOUBLE("德州PK10","两面","第十名","第十名单双", 38),
	/**
	 *  德州PK10  冠军龙虎
	 * */
	JSPKSGJTIDRAGON("德州PK10","两面","冠军","冠军龙虎", 39),
	/**
	 *  德州PK10  亚军龙虎
	 * */
	JSPKSYJTIDRAGON("德州PK10","两面","亚军","亚军龙虎", 40),
	/**
	 *  德州PK10  第三名龙虎
	 * */
	JSPKSDSMTIDRAGON("德州PK10","两面","第三名","第三名龙虎", 41),
	/**
	 *  德州PK10  第四名龙虎
	 * */
	JSPKSDFMTIDRAGON("德州PK10","两面","第四名","第四名龙虎", 42),
	/**
	 *  德州PK10  第五名龙虎
	 * */
	JSPKSDWMTIDRAGON("德州PK10","两面","第五名","第五名龙虎", 43),
	/**
	 *  德州六合彩  特码两面单双
	 * */
	ONELHCTMLMDOUBLEDRAGON("德州六合彩","两面","特码两面","特码两面单双", 44),
	/**
	 *  德州六合彩  特码两面大小
	 * */
	ONELHCTMLMBIGDRAGON("德州六合彩","两面","特码两面","特码两面大小", 45),
	/**
	 *  德州六合彩  正码总单总双
	 * */
	ONELHCZMTOTALDRAGON("德州六合彩","正码","正码两面","正码总单总双", 46),
	/**
	 *  德州六合彩  正码总大总小
	 * */
	ONELHCTOTALBIGDRAGON("德州六合彩","正码","正码两面","正码总大总小", 47),
	/**
	 *  德州六合彩  正1特单双
	 * */
	ONELHCZYTDOUBLEDRAGON("德州六合彩","正特","正1特两面","正1特单双", 48),
	/**
	 *  德州六合彩  正2特单双
	 * */
	ONELHCZETDOUBLEDRAGON("德州六合彩","正特","正2特两面","正2特单双", 49),
	/**
	 *  德州六合彩  正3特单双
	 * */
	ONELHCZSTDOUBLEDRAGON("德州六合彩","正特","正3特两面","正3特单双", 50),
	/**
	 *  德州六合彩  正4特单双
	 * */
	ONELHCZFTDOUBLEDRAGON("德州六合彩","正特","正4特两面","正4特单双", 51),
	/**
	 *  德州六合彩  正5特单双
	 * */
	ONELHCZWTDOUBLEDRAGON("德州六合彩","正特","正5特两面","正5特单双", 52),
	/**
	 *  德州六合彩  正6特单双
	 * */
	ONELHCZLTDOUBLEDRAGON("德州六合彩","正特","正6特两面","正6特单双", 53),
	/**
	 *  德州六合彩  正1特大小
	 * */
	ONELHCZYTBIGDRAGON("德州六合彩","正特","正1特两面", "正1特大小", 54),
	/**
	 *  德州六合彩  正2特大小
	 * */
	ONELHCZETBIGDRAGON("德州六合彩","正特","正2特两面", "正2特大小", 55),
	/**
	 *  德州六合彩  正3特大小
	 * */
	ONELHCZSTBIGDRAGON("德州六合彩","正特","正3特两面", "正3特大小", 56),
	/**
	 *  德州六合彩  正4特大小
	 * */
	ONELHCZFTBIGDRAGON("德州六合彩","正特","正4特两面", "正4特大小", 57),
	/**
	 *  德州六合彩  正5特大小
	 * */
	ONELHCZWTBIGDRAGON("德州六合彩","正特","正5特两面", "正5特大小", 58),
	/**
	 *  德州六合彩  正6特大小
	 * */
	ONELHCZLTBIGDRAGON("德州六合彩","正特","正6特两面", "正6特大小", 59),
	/**
	 *  5分时时彩  两面总和大小  
	 * */
	FIVESSCLMZHBIG("5分时时彩","两面","总和、龙虎","总和大小", 60),
	/**
	 *  5分时时彩  第一球大小  
	 * */
	FIVESSCDYQBIG("5分时时彩","两面","第一球","第一球大小", 61),
	/**
	 *  5分时时彩  第二球大小  
	 * */
	FIVESSCDEQBIG("5分时时彩","两面","第二球","第二球大小", 62),
	/**
	 *  5分时时彩  第三球大小  
	 * */
	FIVESSCDSQBIG("5分时时彩","两面","第三球","第三球大小", 63),
	/**
	 *  5分时时彩  第四球大小  
	 * */
	FIVESSCDFQBIG("5分时时彩","两面","第四球","第四球大小", 64),
	/**
	 * 5分时时彩  第五球大小  
	 * */
	FIVESSCDWQBIG("5分时时彩","两面","第五球","第五球大小", 65),
	/**
	 *  5分时时彩  两面总和单双 
	 * */
	FIVESSCLMZHDOUBLE("5分时时彩","两面","总和、龙虎","总和单双", 66),
	/**
	 *  5分时时彩  第一球单双 
	 * */
	FIVESSCDYQDOUBLE("5分时时彩","两面","第一球","第一球单双", 67),
	/**
	 *  5分时时彩  第二球单双 
	 * */
	FIVESSCDEQDOUBLE("5分时时彩","两面","第二球","第二球单双", 68),
	/**
	 *  5分时时彩  第三球单双 
	 * */
	FIVESSCDSQDOUBLE("5分时时彩","两面","第三球","第三球单双", 69),
	/**
	 *  5分时时彩  第四球单双 
	 * */
	FIVESSCDFQDOUBLE("5分时时彩","两面","第四球","第四球单双", 70),
	/**
	 *  5分时时彩  第五球单双 
	 * */
	FIVESSCDWQDOUBLE("5分时时彩","两面","第五球","第五球单双", 71),
	/**
	 *  10分时时彩  两面总和大小  
	 * */
	TENSSCLMZHBIG("10分时时彩","两面","总和、龙虎","总和大小", 72),
	/**
	 *  10分时时彩  第一球大小  
	 * */
	TENSSCDYQBIG("10分时时彩","两面","第一球","第一球大小", 73),
	/**
	 *  10分时时彩  第二球大小  
	 * */
	TENSSCDEQBIG("10分时时彩","两面","第二球","第二球大小", 74),
	/**
	 *  10分时时彩  第三球大小  
	 * */
	TENSSCDSQBIG("10分时时彩","两面","第三球","第三球大小", 75),
	/**
	 *  10分时时彩  第四球大小  
	 * */
	TENSSCDFQBIG("10分时时彩","两面","第四球","第四球大小", 76),
	/**
	 * 10分时时彩  第五球大小  
	 * */
	TENSSCDWQBIG("10分时时彩","两面","第五球","第五球大小", 77),
	/**
	 *  10分时时彩  两面总和单双 
	 * */
	TENSSCLMZHDOUBLE("10分时时彩","两面","总和、龙虎","总和单双", 78),
	/**
	 *  10分时时彩  第一球单双 
	 * */
	TENSSCDYQDOUBLE("10分时时彩","两面","第一球","第一球单双", 79),
	/**
	 *  10分时时彩  第二球单双 
	 * */
	TENSSCDEQDOUBLE("10分时时彩","两面","第二球","第二球单双", 80),
	/**
	 *  10分时时彩  第三球单双 
	 * */
	TENSSCDSQDOUBLE("10分时时彩","两面","第三球","第三球单双", 81),
	/**
	 *  10分时时彩  第四球单双 
	 * */
	TENSSCDFQDOUBLE("10分时时彩","两面","第四球","第四球单双", 82),
	/**
	 *  10分时时彩  第五球单双 
	 * */
	TENSSCDWQDOUBLE("10分时时彩","两面","第五球","第五球单双", 83),
	/**
	 *  天津时时彩  两面总和大小  
	 * */
	TJSSCLMZHBIG("天津时时彩","两面","总和、龙虎","总和大小", 84),
	/**
	 *  天津时时彩  第一球大小  
	 * */
	TJSSCDYQBIG("天津时时彩","两面","第一球","第一球大小", 85),
	/**
	 *  天津时时彩  第二球大小  
	 * */
	TJSSCDEQBIG("天津时时彩","两面","第二球","第二球大小", 86),
	/**
	 *  天津时时彩  第三球大小  
	 * */
	TJSSCDSQBIG("天津时时彩","两面","第三球","第三球大小", 87),
	/**
	 *  天津时时彩  第四球大小  
	 * */
	TJSSCDFQBIG("天津时时彩","两面","第四球","第四球大小", 88),
	/**
	 * 天津时时彩  第五球大小  
	 * */
	TJSSCDWQBIG("天津时时彩","两面","第五球","第五球大小", 89),
	/**
	 *  天津时时彩  两面总和单双 
	 * */
	TJSSCLMZHDOUBLE("天津时时彩","两面","总和、龙虎","总和单双", 90),
	/**
	 *  天津时时彩  第一球单双 
	 * */
	TJSSCDYQDOUBLE("天津时时彩","两面","第一球","第一球单双", 91),
	/**
	 *  天津时时彩  第二球单双 
	 * */
	TJSSCDEQDOUBLE("天津时时彩","两面","第二球","第二球单双", 92),
	/**
	 *  天津时时彩  第三球单双 
	 * */
	TJSSCDSQDOUBLE("天津时时彩","两面","第三球","第三球单双", 93),
	/**
	 *  天津时时彩  第四球单双 
	 * */
	TJSSCDFQDOUBLE("天津时时彩","两面","第四球","第四球单双", 94),
	/**
	 *  天津时时彩  第五球单双 
	 * */
	TJSSCDWQDOUBLE("天津时时彩","两面","第五球","第五球单双", 95),
	/**
	 *  新疆时时彩  两面总和大小  
	 * */
	XJSSCLMZHBIG("新疆时时彩","两面","总和、龙虎","总和大小", 96),
	/**
	 *  新疆时时彩  第一球大小  
	 * */
	XJSSCDYQBIG("新疆时时彩","两面","第一球","第一球大小", 97),
	/**
	 *  新疆时时彩  第二球大小  
	 * */
	XJSSCDEQBIG("新疆时时彩","两面","第二球","第二球大小", 98),
	/**
	 *  新疆时时彩  第三球大小  
	 * */
	XJSSCDSQBIG("新疆时时彩","两面","第三球","第三球大小", 99),
	/**
	 *  新疆时时彩  第四球大小  
	 * */
	XJSSCDFQBIG("新疆时时彩","两面","第四球","第四球大小", 100),
	/**
	 *  新疆时时彩  第五球大小  
	 * */
	XJSSCDWQBIG("新疆时时彩","两面","第五球","第五球大小", 101),
	/**
	 *  新疆时时彩  两面总和单双 
	 * */
	XJSSCLMZHDOUBLE("新疆时时彩","两面","总和、龙虎","总和单双", 102),
	/**
	 *  新疆时时彩  第一球单双 
	 * */
	XJSSCDYQDOUBLE("新疆时时彩","两面","第一球","第一球单双", 103),
	/**
	 *  新疆时时彩  第二球单双 
	 * */
	XJSSCDEQDOUBLE("新疆时时彩","两面","第二球","第二球单双", 104),
	/**
	 *  新疆时时彩  第三球单双 
	 * */
	XJSSCDSQDOUBLE("新疆时时彩","两面","第三球","第三球单双", 105),
	/**
	 *  新疆时时彩  第四球单双 
	 * */
	XJSSCDFQDOUBLE("新疆时时彩","两面","第四球","第四球单双", 106),
	/**
	 *  新疆时时彩  第五球单双 
	 * */
	XJSSCDWQDOUBLE("新疆时时彩","两面","第五球","第五球单双", 107),
	/**
	 *  重庆时时彩  两面总和大小  
	 * */
	CQSSCLMZHBIG("重庆时时彩","两面","总和、龙虎","总和大小", 108),
	/**
	 *  重庆时时彩  第一球大小  
	 * */
	CQSSCDYQBIG("重庆时时彩","两面","第一球","第一球大小", 109),
	/**
	 *  重庆时时彩  第二球大小  
	 * */
	CQSSCDEQBIG("重庆时时彩","两面","第二球","第二球大小", 110),
	/**
	 *  重庆时时彩  第三球大小  
	 * */
	CQSSCDSQBIG("重庆时时彩","两面","第三球","第三球大小", 111),
	/**
	 *  重庆时时彩  第四球大小  
	 * */
	CQSSCDFQBIG("重庆时时彩","两面","第四球","第四球大小", 112),
	/**
	 *  重庆时时彩  第五球大小  
	 * */
	CQSSCDWQBIG("重庆时时彩","两面","第五球","第五球大小", 113),
	/**
	 *  重庆时时彩  两面总和单双 
	 * */
	CQSSCLMZHDOUBLE("重庆时时彩","两面","总和、龙虎","总和单双", 114),
	/**
	 *  重庆时时彩  第一球单双 
	 * */
	CQSSCDYQDOUBLE("重庆时时彩","两面","第一球","第一球单双", 115),
	/**
	 *  重庆时时彩  第二球单双 
	 * */
	CQSSCDEQDOUBLE("重庆时时彩","两面","第二球","第二球单双", 116),
	/**
	 *  重庆时时彩  第三球单双 
	 * */
	CQSSCDSQDOUBLE("重庆时时彩","两面","第三球","第三球单双", 117),
	/**
	 *  重庆时时彩  第四球单双 
	 * */
	CQSSCDFQDOUBLE("重庆时时彩","两面","第四球","第四球单双", 118),
	/**
	 *  重庆时时彩  第五球单双 
	 * */
	CQSSCDWQDOUBLE("重庆时时彩","两面","第五球","第五球单双", 119),
	/**
	 *  5分PK10  冠亚和大小 
	 * */
	FIVEPKSGYHBIG("5分PK10","两面","冠亚和","冠亚和大小", 120),
	/**
	 *  5分PK10  冠军大小 
	 * */
	FIVEPKSGJBIG("5分PK10","两面","冠军","冠军大小", 121),
	/**
	 *  5分PK10  亚军大小 
	 * */
	FIVEPKSYJBIG("5分PK10","两面","亚军","亚军大小", 122),
	/**
	 *  5分PK10  第三名大小 
	 * */
	FIVEPKSDSMBIG("5分PK10","两面","第三名","第三名大小", 123),
	/**
	 *  5分PK10  第四名大小 
	 * */
	FIVEPKSDFMBIG("5分PK10","两面","第四名","第四名大小", 124),
	/**
	 *  5分PK10  第五名大小 
	 * */
	FIVEPKSDWMBIG("5分PK10","两面","第五名","第五名大小", 125),
	/**
	 *  5分PK10  第六名大小
	 * */
	FIVEPKSDLMBIG("5分PK10","两面","第六名","第六名大小", 126),
	/**
	 *  5分PK10  第七名大小
	 * */
	FIVEPKSDQMBIG("5分PK10","两面","第七名","第七名大小", 127),
	/**
	 *  5分PK10  第八名大小
	 * */
	FIVEPKSDMMBIG("5分PK10","两面","第八名","第八名大小", 128),
	/**
	 *  5分PK10  第九名大小
	 * */
	FIVEPKSDJMBIG("5分PK10","两面","第九名","第九名大小", 129),
	/**
	 *  5分PK10  第十名大小
	 * */
	FIVEPKSDTMBIG("5分PK10","两面","第十名","第十名大小", 130),
	/**
	 *  5分PK10  冠亚和单双 
	 * */
	FIVEPKSGYHDOUBLE("5分PK10","两面","冠亚和","冠亚和单双", 131),
	/**
	 *  5分PK10  冠军单双 
	 * */
	FIVEPKSGJDOUBLE("5分PK10","两面","冠军","冠军单双", 132),
	/**
	 *  5分PK10  亚军单双 
	 * */
	FIVEPKSYJDOUBLE("5分PK10","两面","亚军","亚军单双", 133),
	/**
	 *  5分PK10  第三名单双
	 * */
	FIVEPKSDSMDOUBLE("5分PK10","两面","第三名","第三名单双", 134),
	/**
	 *  5分PK10  第四名单双
	 * */
	FIVEPKSDFMDOUBLE("5分PK10","两面","第四名","第四名单双", 135),
	/**
	 *  5分PK10  第五名单双
	 * */
	FIVEPKSDWMDOUBLE("5分PK10","两面","第五名","第五名单双", 136),
	/**
	 *  5分PK10  第六名单双
	 * */
	FIVEPKSDLMDOUBLE("5分PK10","两面","第六名","第六名单双", 137),
	/**
	 *  5分PK10  第七名单双
	 * */
	FIVEPKSDQMDOUBLE("5分PK10","两面","第七名","第七名单双", 138),
	/**
	 *  5分PK10  第八名单双
	 * */
	FIVEPKSDMMDOUBLE("5分PK10","两面","第八名","第八名单双", 139),
	/**
	 *  5分PK10  第九名单双
	 * */
	FIVEPKSDJMDOUBLE("5分PK10","两面","第九名","第九名单双", 140),
	/**
	 *  5分PK10  第十名单双
	 * */
	FIVEPKSDTMDOUBLE("5分PK10","两面","第十名","第十名单双", 141),
	/**
	 *  5分PK10  冠军龙虎
	 * */
	FIVEPKSGJTIDRAGON("5分PK10","两面","冠军","冠军龙虎", 142),
	/**
	 *  5分PK10  亚军龙虎
	 * */
	FIVEPKSYJTIDRAGON("5分PK10","两面","亚军","亚军龙虎", 143),
	/**
	 *  5分PK10  第三名龙虎
	 * */
	FIVEPKSDSMTIDRAGON("5分PK10","两面","第三名","第三名龙虎", 144),
	/**
	 *  5分PK10  第四名龙虎
	 * */
	FIVEPKSDFMTIDRAGON("5分PK10","两面","第四名","第四名龙虎", 145),
	/**
	 *  5分PK10  第五名龙虎
	 * */
	FIVEPKSDWMTIDRAGON("5分PK10","两面","第五名","第五名龙虎", 146),
	/**
	 *  10分PK10  冠亚和大小 
	 * */
	TENPKSGYHBIG("10分PK10","两面","冠亚和","冠亚和大小", 147),
	/**
	 *  10分PK10  冠军大小 
	 * */
	TENPKSGJBIG("10分PK10","两面","冠军","冠军大小", 148),
	/**
	 *  10分PK10  亚军大小 
	 * */
	TENPKSYJBIG("10分PK10","两面","亚军","亚军大小", 149),
	/**
	 *  10分PK10  第三名大小 
	 * */
	TENPKSDSMBIG("10分PK10","两面","第三名","第三名大小", 150),
	/**
	 *  10分PK10  第四名大小 
	 * */
	TENPKSDFMBIG("10分PK10","两面","第四名","第四名大小", 151),
	/**
	 *  10分PK10  第五名大小 
	 * */
	TENPKSDWMBIG("10分PK10","两面","第五名","第五名大小", 152),
	/**
	 *  10分PK10  第六名大小
	 * */
	TENPKSDLMBIG("10分PK10","两面","第六名","第六名大小", 153),
	/**
	 *  10分PK10  第七名大小
	 * */
	TENPKSDQMBIG("10分PK10","两面","第七名","第七名大小", 154),
	/**
	 *  10分PK10  第八名大小
	 * */
	TENPKSDMMBIG("10分PK10","两面","第八名","第八名大小", 155),
	/**
	 *  10分PK10  第九名大小
	 * */
	TENPKSDJMBIG("10分PK10","两面","第九名","第九名大小", 156),
	/**
	 *  10分PK10  第十名大小
	 * */
	TENPKSDTMBIG("10分PK10","两面","第十名","第十名大小", 157),
	/**
	 *  10分PK10  冠亚和单双 
	 * */
	TENPKSGYHDOUBLE("10分PK10","两面","冠亚和","冠亚和单双", 158),
	/**
	 *  10分PK10  冠军单双 
	 * */
	TENPKSGJDOUBLE("10分PK10","两面","冠军","冠军单双", 159),
	/**
	 *  10分PK10  亚军单双 
	 * */
	TENPKSYJDOUBLE("10分PK10","两面","亚军","亚军单双", 160),
	/**
	 *  10分PK10  第三名单双
	 * */
	TENPKSDSMDOUBLE("10分PK10","两面","第三名","第三名单双", 161),
	/**
	 *  10分PK10  第四名单双
	 * */
	TENPKSDFMDOUBLE("10分PK10","两面","第四名","第四名单双", 162),
	/**
	 *  10分PK10  第五名单双
	 * */
	TENPKSDWMDOUBLE("10分PK10","两面","第五名","第五名单双", 163),
	/**
	 *  10分PK10  第六名单双
	 * */
	TENPKSDLMDOUBLE("10分PK10","两面","第六名","第六名单双", 164),
	/**
	 *  10分PK10  第七名单双
	 * */
	TENPKSDQMDOUBLE("10分PK10","两面","第七名","第七名单双", 165),
	/**
	 *  10分PK10  第八名单双
	 * */
	TENPKSDMMDOUBLE("10分PK10","两面","第八名","第八名单双", 166),
	/**
	 *  10分PK10  第九名单双
	 * */
	TENPKSDJMDOUBLE("10分PK10","两面","第九名","第九名单双", 167),
	/**
	 *  10分PK10  第十名单双
	 * */
	TENPKSDTMDOUBLE("10分PK10","两面","第十名","第十名单双", 168),
	/**
	 *  10分PK10   冠军龙虎
	 * */
	TENPKSGJTIDRAGON("10分PK10","两面","冠军","冠军龙虎", 169),
	/**
	 *  10分PK10   亚军龙虎
	 * */
	TENPKSYJTIDRAGON("10分PK10","两面","亚军","亚军龙虎", 170),
	/**
	 *  10分PK10   第三名龙虎
	 * */
	TENPKSDSMTIDRAGON("10分PK10","两面","第三名","第三名龙虎", 171),
	/**
	 *  10分PK10   第四名龙虎
	 * */
	TENPKSDFMTIDRAGON("10分PK10","两面","第四名","第四名龙虎", 172),
	/**
	 *  10分PK10   第五名龙虎
	 * */
	TENPKSDWMTIDRAGON("10分PK10","两面","第五名","第五名龙虎", 173),
	/**
	 *  北京PK10  冠亚和大小 
	 * */
	BJPKSGYHBIG("北京PK10","两面","冠亚和","冠亚和大小", 174),
	/**
	 *  北京PK10  冠军大小 
	 * */
	BJPKSGJBIG("北京PK10","两面","冠军","冠军大小", 175),
	/**
	 *  北京PK10  亚军大小 
	 * */
	BJPKSYJBIG("北京PK10","两面","亚军","亚军大小", 176),
	/**
	 *  北京PK10  第三名大小 
	 * */
	BJPKSDSMBIG("北京PK10","两面","第三名","第三名大小", 177),
	/**
	 *  北京PK10  第四名大小 
	 * */
	BJPKSDFMBIG("北京PK10","两面","第四名","第四名大小", 178),
	/**
	 *  北京PK10  第五名大小 
	 * */
	BJPKSDWMBIG("北京PK10","两面","第五名","第五名大小", 179),
	/**
	 *  北京PK10  第六名大小
	 * */
	BJPKSDLMBIG("北京PK10","两面","第六名","第六名大小", 180),
	/**
	 *  北京PK10  第七名大小
	 * */
	BJPKSDQMBIG("北京PK10","两面","第七名","第七名大小", 181),
	/**
	 *  北京PK10  第八名大小
	 * */
	BJPKSDMMBIG("北京PK10","两面","第八名","第八名大小", 182),
	/**
	 *  北京PK10  第九名大小
	 * */
	BJPKSDJMBIG("北京PK10","两面","第九名","第九名大小", 183),
	/**
	 *  北京PK10  第十名大小
	 * */
	BJPKSDTMBIG("北京PK10","两面","第十名","第十名大小", 184),
	/**
	 *  北京PK10   冠亚和单双 
	 * */
	BJPKSGYHDOUBLE("北京PK10","两面","冠亚和","冠亚和单双", 185),
	/**
	 *  北京PK10   冠军单双 
	 * */
	BJPKSGJDOUBLE("北京PK10","两面","冠军","冠军单双", 186),
	/**
	 *  北京PK10   亚军单双 
	 * */
	BJPKSYJDOUBLE("北京PK10","两面","亚军","亚军单双", 187),
	/**
	 *  北京PK10   第三名单双
	 * */
	BJPKSDSMDOUBLE("北京PK10","两面","第三名","第三名单双", 188),
	/**
	 *  北京PK10   第四名单双
	 * */
	BJPKSDFMDOUBLE("北京PK10","两面","第四名","第四名单双", 189),
	/**
	 *  北京PK10   第五名单双
	 * */
	BJPKSDWMDOUBLE("北京PK10","两面","第五名","第五名单双", 190),
	/**
	 *  北京PK10   第六名单双
	 * */
	BJPKSDLMDOUBLE("北京PK10","两面","第六名","第六名单双", 191),
	/**
	 *  北京PK10   第七名单双
	 * */
	BJPKSDQMDOUBLE("北京PK10","两面","第七名","第七名单双", 192),
	/**
	 *  北京PK10   第八名单双
	 * */
	BJPKSDMMDOUBLE("北京PK10","两面","第八名","第八名单双", 193),
	/**
	 *  北京PK10   第九名单双
	 * */
	BJPKSDJMDOUBLE("北京PK10","两面","第九名","第九名单双", 194),
	/**
	 *  北京PK10   第十名单双
	 * */
	BJPKSDTMDOUBLE("北京PK10","两面","第十名","第十名单双", 195),
	/**
	 *  北京PK10  冠军龙虎
	 * */
	BJPKSGJTIDRAGON("北京PK10","两面","冠军","冠军龙虎", 196),
	/**
	 *  北京PK10  亚军龙虎
	 * */
	BJPKSYJTIDRAGON("北京PK10","两面","亚军","亚军龙虎", 197),
	/**
	 *  北京PK10  第三名龙虎
	 * */
	BJPKSDSMTIDRAGON("北京PK10","两面","第三名","第三名龙虎", 198),
	/**
	 *  北京PK10  第四名龙虎
	 * */
	BJPKSDFMTIDRAGON("北京PK10","两面","第四名","第四名龙虎", 199),
	/**
	 *  北京PK10  第五名龙虎
	 * */
	BJPKSDWMTIDRAGON("北京PK10","两面","第五名","第五名龙虎", 200),
	/**
	 *  5分六合彩  特码两面单双
	 * */
	FIVELHCTMLMDOUBLEDRAGON("5分六合彩","两面","特码两面","特码两面单双", 201),
	/**
	 *  5分六合彩  特码两面大小
	 * */
	FIVELHCTMLMBIGDRAGON("5分六合彩","两面","特码两面","特码两面大小", 202),
	/**
	 *  5分六合彩  正码总单总双
	 * */
	FIVELHCZMTOTALDRAGON("5分六合彩","正码","正码两面","正码总单总双", 203),
	/**
	 *  5分六合彩  正码总大总小
	 * */
	FIVELHCTOTALBIGDRAGON("5分六合彩","正码","正码两面","正码总大总小", 204),
	/**
	 *  5分六合彩  正1特单双
	 * */
	FIVELHCZYTDOUBLEDRAGON("5分六合彩","正特","正1特两面","正1特单双", 205),
	/**
	 *  5分六合彩  正2特单双
	 * */
	FIVELHCZETDOUBLEDRAGON("5分六合彩","正特","正2特两面","正2特单双", 206),
	/**
	 *  5分六合彩  正3特单双
	 * */
	FIVELHCZSTDOUBLEDRAGON("5分六合彩","正特","正3特两面","正3特单双", 207),
	/**
	 *  5分六合彩  正4特单双
	 * */
	FIVELHCZFTDOUBLEDRAGON("5分六合彩","正特","正4特两面","正4特单双", 208),
	/**
	 *  5分六合彩  正5特单双
	 * */
	FIVELHCZWTDOUBLEDRAGON("5分六合彩","正特","正5特两面","正5特单双", 209),
	/**
	 *  5分六合彩  正6特单双
	 * */
	FIVELHCZLTDOUBLEDRAGON("5分六合彩","正特","正6特两面","正6特单双", 210),
	/**
	 *  5分六合彩  正1特大小
	 * */
	FIVELHCZYTBIGDRAGON("5分六合彩","正特","正1特两面","正1特大小", 211),
	/**
	 *  5分六合彩  正2特大小
	 * */
	FIVELHCZETBIGDRAGON("5分六合彩","正特","正2特两面","正2特大小", 212),
	/**
	 *  5分六合彩  正3特大小
	 * */
	FIVELHCZSTBIGDRAGON("5分六合彩","正特","正3特两面","正3特大小", 213),
	/**
	 *  5分六合彩  正4特大小
	 * */
	FIVELHCZFTBIGDRAGON("5分六合彩","正特","正4特两面","正4特大小", 214),
	/**
	 *  5分六合彩  正5特大小
	 * */
	FIVELHCZWTBIGDRAGON("5分六合彩","正特","正5特两面","正5特大小", 215),
	/**
	 *  5分六合彩  正6特大小
	 * */
	FIVELHCZLTBIGDRAGON("5分六合彩","正特","正6特两面","正6特大小", 216),
	/**
	 *  澳门六合彩  特码两面单双
	 * */
	SSLHCTMLMDOUBLEDRAGON("澳门六合彩","两面","特码两面","特码两面单双", 217),
	/**
	 *  澳门六合彩  特码两面大小
	 * */
	SSLHCTMLMBIGDRAGON("澳门六合彩","两面","特码两面","特码两面大小", 218),
	/**
	 *  澳门六合彩  正码总单总双
	 * */
	SSLHCZMTOTALDRAGON("澳门六合彩","正码","正码两面","正码总单总双", 219),
	/**
	 *  澳门六合彩  正码总大总小
	 * */
	SSLHCTOTALBIGDRAGON("澳门六合彩","正码","正码两面","正码总大总小", 220),
	/**
	 *  澳门六合彩  正1特单双
	 * */
	SSLHCZYTDOUBLEDRAGON("澳门六合彩","正特","正1特两面","正1特单双", 221),
	/**
	 *  澳门六合彩  正2特单双
	 * */
	SSLHCZETDOUBLEDRAGON("澳门六合彩","正特","正2特两面","正2特单双", 222),
	/**
	 *  澳门六合彩  正3特单双
	 * */
	SSLHCZSTDOUBLEDRAGON("澳门六合彩","正特","正3特两面","正3特单双", 223),
	/**
	 *  澳门六合彩  正4特单双
	 * */
	SSLHCZFTDOUBLEDRAGON("澳门六合彩","正特","正4特两面","正4特单双", 224),
	/**
	 *  澳门六合彩  正5特单双
	 * */
	SSLHCZWTDOUBLEDRAGON("澳门六合彩","正特","正5特两面","正5特单双", 225),
	/**
	 *  澳门六合彩  正6特单双
	 * */
	SSLHCZLTDOUBLEDRAGON("澳门六合彩","正特","正6特两面","正6特单双", 226),
	/**
	 *  澳门六合彩  正1特大小
	 * */
	SSLHCZYTBIGDRAGON("澳门六合彩","正特","正1特两面","正1特大小", 227),
	/**
	 *  澳门六合彩  正2特大小
	 * */
	SSLHCZETBIGDRAGON("澳门六合彩","正特","正2特两面","正2特大小", 228),
	/**
	 *  澳门六合彩  正3特大小
	 * */
	SSLHCZSTBIGDRAGON("澳门六合彩","正特","正3特两面","正3特大小", 229),
	/**
	 *  澳门六合彩  正4特大小
	 * */
	SSLHCZFTBIGDRAGON("澳门六合彩","正特","正4特两面","正4特大小", 230),
	/**
	 *  澳门六合彩  正5特大小
	 * */
	SSLHCZWTBIGDRAGON("澳门六合彩","正特","正5特两面","正5特大小", 231),
	/**
	 *  澳门六合彩  正6特大小
	 * */
	SSLHCZLTBIGDRAGON("澳门六合彩","正特","正6特两面", "正6特大小", 232),
	/**
	 *  腾讯分分彩  两面总和大小
	 * */
	TXFFCLMZHBIG("腾讯分分彩","两面","总和、龙虎","总和大小", 233),
	/**
	 *  腾讯分分彩  第一球大小
	 * */
	TXFFCDYQBIG("腾讯分分彩","两面","第一球","第一球大小", 234),
	/**
	 *  腾讯分分彩  第二球大小
	 * */
	TXFFCDEQBIG("腾讯分分彩","两面","第二球","第二球大小", 235),
	/**
	 *  腾讯分分彩  第三球大小
	 * */
	TXFFCDSQBIG("腾讯分分彩","两面","第三球","第三球大小", 236),
	/**
	 *  腾讯分分彩  第四球大小
	 * */
	TXFFCDFQBIG("腾讯分分彩","两面","第四球","第四球大小", 237),
	/**
	 * 腾讯分分彩  第五球大小
	 * */
	TXFFCDWQBIG("腾讯分分彩","两面","第五球","第五球大小", 238),
	/**
	 *  腾讯分分彩  两面总和单双
	 * */
	TXFFCLMZHDOUBLE("腾讯分分彩","两面","总和、龙虎","总和单双", 239),
	/**
	 *  腾讯分分彩  第一球单双
	 * */
	TXFFCDYQDOUBLE("腾讯分分彩","两面","第一球","第一球单双", 240),
	/**
	 *  腾讯分分彩  第二球单双
	 * */
	TXFFCDEQDOUBLE("腾讯分分彩","两面","第二球","第二球单双", 241),
	/**
	 *  腾讯分分彩  第三球单双
	 * */
	TXFFCDSQDOUBLE("腾讯分分彩","两面","第三球","第三球单双", 242),
	/**
	 *  腾讯分分彩  第四球单双
	 * */
	TXFFCDFQDOUBLE("腾讯分分彩","两面","第四球","第四球单双", 243),
	/**
	 *  腾讯分分彩  第五球单双
	 * */
	TXFFCDWQDOUBLE("腾讯分分彩","两面","第五球","第五球单双", 244),
	/**
	 *  幸运飞艇  冠亚和大小
	 * */
	XYFTPKSGYHBIG("幸运飞艇","两面","冠亚和","冠亚和大小", 245),
	/**
	 *  幸运飞艇  冠军大小
	 * */
	XYFTPKSGJBIG("幸运飞艇","两面","冠军","冠军大小", 246),
	/**
	 *  幸运飞艇  亚军大小
	 * */
	XYFTPKSYJBIG("幸运飞艇","两面","亚军","亚军大小", 247),
	/**
	 *  幸运飞艇  第三名大小
	 * */
	XYFTPKSDSMBIG("幸运飞艇","两面","第三名","第三名大小", 248),
	/**
	 *  幸运飞艇  第四名大小
	 * */
	XYFTPKSDFMBIG("幸运飞艇","两面","第四名","第四名大小", 249),
	/**
	 *  幸运飞艇  第五名大小
	 * */
	XYFTPKSDWMBIG("幸运飞艇","两面","第五名","第五名大小", 250),
	/**
	 *  幸运飞艇  第六名大小
	 * */
	XYFTPKSDLMBIG("幸运飞艇","两面","第六名","第六名大小", 251),
	/**
	 *  幸运飞艇  第七名大小
	 * */
	XYFTPKSDQMBIG("幸运飞艇","两面","第七名","第七名大小", 252),
	/**
	 *  幸运飞艇  第八名大小
	 * */
	XYFTPKSDMMBIG("幸运飞艇","两面","第八名","第八名大小", 253),
	/**
	 *  幸运飞艇  第九名大小
	 * */
	XYFTPKSDJMBIG("幸运飞艇","两面","第九名","第九名大小", 254),
	/**
	 *  幸运飞艇  第十名大小
	 * */
	XYFTPKSDTMBIG("幸运飞艇","两面","第十名","第十名大小", 255),
	/**
	 *  幸运飞艇   冠亚和单双
	 * */
	XYFTPKSGYHDOUBLE("幸运飞艇","两面","冠亚和","冠亚和单双", 256),
	/**
	 *  幸运飞艇   冠军单双
	 * */
	XYFTPKSGJDOUBLE("幸运飞艇","两面","冠军","冠军单双", 257),
	/**
	 *  幸运飞艇   亚军单双
	 * */
	XYFTPKSYJDOUBLE("幸运飞艇","两面","亚军","亚军单双", 258),
	/**
	 *  幸运飞艇   第三名单双
	 * */
	XYFTPKSDSMDOUBLE("幸运飞艇","两面","第三名","第三名单双", 259),
	/**
	 *  幸运飞艇   第四名单双
	 * */
	XYFTPKSDFMDOUBLE("幸运飞艇","两面","第四名","第四名单双", 260),
	/**
	 *  幸运飞艇   第五名单双
	 * */
	XYFTPKSDWMDOUBLE("幸运飞艇","两面","第五名","第五名单双", 261),
	/**
	 *  幸运飞艇   第六名单双
	 * */
	XYFTPKSDLMDOUBLE("幸运飞艇","两面","第六名","第六名单双", 262),
	/**
	 *  幸运飞艇   第七名单双
	 * */
	XYFTPKSDQMDOUBLE("幸运飞艇","两面","第七名","第七名单双", 263),
	/**
	 *  幸运飞艇   第八名单双
	 * */
	XYFTPKSDMMDOUBLE("幸运飞艇","两面","第八名","第八名单双", 264),
	/**
	 *  幸运飞艇   第九名单双
	 * */
	XYFTPKSDJMDOUBLE("幸运飞艇","两面","第九名","第九名单双", 265),
	/**
	 *  幸运飞艇   第十名单双
	 * */
	XYFTPKSDTMDOUBLE("幸运飞艇","两面","第十名","第十名单双", 266),
	/**
	 *  幸运飞艇  冠军龙虎
	 * */
	XYFTPKSGJTIDRAGON("幸运飞艇","两面","冠军","冠军龙虎", 267),
	/**
	 *  幸运飞艇  亚军龙虎
	 * */
	XYFTPKSYJTIDRAGON("幸运飞艇","两面","亚军","亚军龙虎", 268),
	/**
	 *  幸运飞艇  第三名龙虎
	 * */
	XYFTPKSDSMTIDRAGON("幸运飞艇","两面","第三名","第三名龙虎", 269),
	/**
	 *  幸运飞艇  第四名龙虎
	 * */
	XYFTPKSDFMTIDRAGON("幸运飞艇","两面","第四名","第四名龙虎", 270),
	/**
	 *  幸运飞艇  第五名龙虎
	 * */
	XYFTPKSDWMTIDRAGON("幸运飞艇","两面","第五名","第五名龙虎", 271);

	private String tagEnName;
	private String playName;
	private String playTag;
	private String tagCnName;
	private int tagType;

	private CaipiaoPlayTypeEnum(String tagEnName,String playName, String playTag, String tagCnName, int tagType) {
		this.tagEnName = tagEnName;
		this.playName = playName;
		this.playTag = playTag;
		this.tagCnName = tagCnName;
		this.tagType = tagType;
	}

	public String getTagEnName() {
		return tagEnName;
	}

	public void setTagEnName(String tagEnName) {
		this.tagEnName = tagEnName;
	}

	public String getTagCnName() {
		return tagCnName;
	}

	public void setTagCnName(String tagCnName) {
		this.tagCnName = tagCnName;
	}

	public int getTagType() {
		return tagType;
	}

	public void setTagType(int tagType) {
		this.tagType = tagType;
	}

	public String getPlayName() {
		return playName;
	}

	public void setPlayName(String playName) {
		this.playName = playName;
	}

	public String getPlayTag() {
		return playTag;
	}

	public void setPlayTag(String playTag) {
		this.playTag = playTag;
	}


//	public static String getValueByType(String enName){
//        for(CaipiaoPlayTypeEnum caipiaoTypeEnum:CaipiaoPlayTypeEnum.values()){
//            if(enName.equals(caipiaoTypeEnum.getTagEnName())){
//                return caipiaoTypeEnum.getTagType();
//            }
//        }
//        return  null;
//	}

}
